package part_two.task_four;

/**
 * Реализовать генератор, который в случайном интервале времени (от 0.5 до 2.5
 * сек) генерирует случайный Point (0<x<200,0<y<100). Необходимо уметь
 * подписываться на событие генерации точки. Щелчок по кнопке создает новый
 * генератор со своим порядковым номером (от 1), и постоянно происходит
 * отображение данного Point с указанием номера генератора.
 */

public class Task04 {

	public static void main(String[] args) {
		StartFrame startFrame = new StartFrame();
	}
	
}
